In [1]:
# Add Matplotlib inline magic command

%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
# Files to load
city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data.csv"

In [3]:
# Read the city data file and store it in a pandas DataFrame.
city_data_df = pd.read_csv(city_data_to_load)
city_data_df.head(10)

            city  driver_count   type
0    Richardfort            38  Urban
1   Williamsstad            59  Urban
2    Port Angela            67  Urban
3     Rodneyfort            34  Urban
4    West Robert            39  Urban
5   West Anthony            70  Urban
6    West Angela            48  Urban
7  Martinezhaven            25  Urban
8      Karenberg            22  Urban
9    Barajasview            26  Urban

In [4]:
# Read the ride data file and store it in a pandas DataFrame.
ride_data_df = pd.read_csv(ride_data_to_load)
ride_data_df.head(10)

                 city              date   fare       ride_id
0  Lake Jonathanshire  2019-01-14 10:14  13.83  5.739410e+12
1  South Michelleport  2019-03-04 18:24  30.24  2.343910e+12
2  Port Samanthamouth   2019-02-24 4:29  33.44  2.005070e+12
3          Rodneyfort  2019-02-10 23:22  23.44  5.149250e+12
4          South Jack   2019-03-06 4:28  34.58  3.908450e+12
5        South Latoya  2019-03-11 12:26   9.52  1.995000e+12
6       New Paulville  2019-02-27 11:17  43.25  7.932080e+11
7        Simpsonburgh   2019-04-26 0:43  35.98  1.119540e+11
8     South Karenland   2019-01-08 3:28  35.09  7.995620e+12
9       North Jasmine   2019-03-09 6:26  42.81  5.327640e+12

In [5]:
# Get the columns and the rows that are not null.
city_data_df.count()

city            120
driver_count    120
type            120
dtype: int64

In [6]:
# Get the columns and the rows that are not null. TO ENSURE NO NULL VALUE
city_data_df.isnull().sum()

city            0
driver_count    0
type            0
dtype: int64

In [7]:
# Get the data types of each column.
city_data_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [8]:
# Get the unique values of the type of city. TO CHECK HOW MANY DATA POINT FOR EACH CITY TYPE
city_data_df["type"].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [9]:
# Combine the data into a single dataset
pyber_data_df = pd.merge( ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the DataFrame
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14,13.83,5.739410e+12,5,Urban
1,South Michelleport,2019-03-04 18:24,30.24,2.343910e+12,72,Urban
2,Port Samanthamouth,2019-02-24 4:29,33.44,2.005070e+12,57,Urban
3,Rodneyfort,2019-02-10 23:22,23.44,5.149250e+12,34,Urban
4,South Jack,2019-03-06 4:28,34.58,3.908450e+12,46,Urban

In [10]:
# Create the Urban city DataFrame.
urban_cities_df = pyber_data_df[pyber_data_df["type"] == "Urban"]
urban_cities_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14,13.83,5.739410e+12,5,Urban
1,South Michelleport,2019-03-04 18:24,30.24,2.343910e+12,72,Urban
2,Port Samanthamouth,2019-02-24 4:29,33.44,2.005070e+12,57,Urban
3,Rodneyfort,2019-02-10 23:22,23.44,5.149250e+12,34,Urban
4,South Jack,2019-03-06 4:28,34.58,3.908450e+12,46,Urban

In [11]:
# Create the Suburban and Rural city DataFrames.
suburban_cities_df = pyber_data_df[pyber_data_df["type"] == "Suburban"]
rural_cities_df = pyber_data_df[pyber_data_df["type"] == "Rural"]

In [200]:

suburban_cities_df.head()

,city,date,fare,ride_id,driver_count,type
1625,Barronchester,2019-01-27 3:08,27.79,6.653620e+12,11,Suburban
1626,East Kentstad,2019-04-07 19:44,18.75,6.575960e+12,20,Suburban
1627,Lake Omar,2019-01-17 21:33,21.71,9.669120e+11,22,Suburban
1628,Myersshire,2019-02-27 17:38,17.10,5.706770e+12,19,Suburban
1629,West Hannah,2019-04-19 1:06,37.78,2.273050e+12,12,Suburban

In [13]:
# Get the sum of the fares for each city type.
total_fares_by_type = pyber_data_df.groupby(["type"]).sum()["fare"]
total_fares_by_type

type
Rural        4327.93
Suburban    19356.33
Urban       39854.38
Name: fare, dtype: float64

In [14]:
#Get the sum of fares for each city type
total_rides_by_type=pyber_data_df.groupby(["type"]).count()["ride_id"]
total_rides_by_type

type
Rural        125
Suburban     625
Urban       1625
Name: ride_id, dtype: int64

In [15]:
#Get the drivers count for each city type
total_drivers_by_type=city_data_df.groupby(["type"]).sum()["driver_count"]
total_drivers_by_type

type
Rural         78
Suburban     490
Urban       2405
Name: driver_count, dtype: int64

In [16]:
# Get Average fare per ride for each city type
average_fare_per_ride=pyber_data_df.groupby(["type"]).mean()["fare"]
average_fare_per_ride

type
Rural       34.623440
Suburban    30.970128
Urban       24.525772
Name: fare, dtype: float64

In [17]:
# Get the average fare per driver each city type
average_fare_per_driver=total_fares_by_type/total_drivers_by_type
average_fare_per_driver

type
Rural       55.486282
Suburban    39.502714
Urban       16.571468
dtype: float64

In [18]:
#Create a data frame
pyber_summary_df = pd.DataFrame({
             
             "Total Rides": total_rides_by_type,
             "Total Drivers": total_drivers_by_type,
             "Total Fares":total_fares_by_type,
             "Average Fare per Ride":average_fare_per_ride,
             "Average Fare per Driver":average_fare_per_driver})

In [19]:
# Remove index name by setting it to "none"
pyber_summary_df.index.name=None

In [20]:
# Obtain Data frame 
pyber_summary_df

,Total Rides,Total Drivers,Total Fares,Average Fare per Ride,Average Fare per Driver
Rural,125,78,4327.93,34.623440,55.486282
Suburban,625,490,19356.33,30.970128,39.502714
Urban,1625,2405,39854.38,24.525772,16.571468

In [21]:

# Format Data Frame
pyber_summary_df["Total Fares"] = pyber_summary_df["Total Fares"].map("${:,.2f}".format)
pyber_summary_df["Average Fare per Ride"] = pyber_summary_df["Average Fare per Ride"].map("${:,.2f}".format)
pyber_summary_df["Average Fare per Driver"] = pyber_summary_df["Average Fare per Driver"].map("${:,.2f}".format)

In [22]:
# Formatted Data Frame
pyber_summary_df

,Total Rides,Total Drivers,Total Fares,Average Fare per Ride,Average Fare per Driver
Rural,125,78,"$4,327.93",$34.62,$55.49
Suburban,625,490,"$19,356.33",$30.97,$39.50
Urban,1625,2405,"$39,854.38",$24.53,$16.57

In [24]:
# Rename Date Frame columns

pyber_data_df.rename(columns={'city':'City', 'date':'Date','fare':'Fare', 'ride_id': 'Ride Id','driver_count': 'No. Drivers', 'type':'City Type'},inplace=True)

In [26]:
# Rename Data Frame output
pyber_data_df.head()

,City,Date,Fare,Ride Id,No. Drivers,City Type
0,Lake Jonathanshire,2019-01-14 10:14,13.83,5.739410e+12,5,Urban
1,South Michelleport,2019-03-04 18:24,30.24,2.343910e+12,72,Urban
2,Port Samanthamouth,2019-02-24 4:29,33.44,2.005070e+12,57,Urban
3,Rodneyfort,2019-02-10 23:22,23.44,5.149250e+12,34,Urban
4,South Jack,2019-03-06 4:28,34.58,3.908450e+12,46,Urban

In [38]:
# Set index to date

pyber_data_rename_df=pyber_data_df.set_index("Date")

In [39]:
pyber_data_rename_df.head()

,City,Fare,Ride Id,No. Drivers,City Type
Date,,,,,
2019-01-14 10:14,Lake Jonathanshire,13.83,5.739410e+12,5,Urban
2019-03-04 18:24,South Michelleport,30.24,2.343910e+12,72,Urban
2019-02-24 4:29,Port Samanthamouth,33.44,2.005070e+12,57,Urban
2019-02-10 23:22,Rodneyfort,23.44,5.149250e+12,34,Urban
2019-03-06 4:28,South Jack,34.58,3.908450e+12,46,Urban

In [41]:
## Use Copy() function to create new Data frame
New_pyber_df = pyber_data_rename_df[["City Type","Fare"]].copy()

In [43]:
New_pyber_df.head()

                 City Type   Fare
Date
2019-01-14 10:14     Urban  13.83
2019-03-04 18:24     Urban  30.24
2019-02-24 4:29      Urban  33.44
2019-02-10 23:22     Urban  23.44
2019-03-06 4:28      Urban  34.58

In [44]:
# Use info () to check confirm index of new data frame
New_pyber_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2375 entries, 2019-01-14 10:14 to 2019-04-25 10:20
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   City Type  2375 non-null   object
 1   Fare       2375 non-null   float64
dtypes: float64(1), object(1)
memory usage: 55.7+ KB

In [189]:
# Use groupby () function to group fares by City and date and create a dat frame

Fares_by_cities_Dates= pd.DataFrame({"Fare": New_pyber_df.groupby(["City Type","Date"]).sum()["Fare"]})

In [190]:
# Date frame output based on above
Fares_by_cities_Dates

                             Fare
City Type Date
Rural     2019-01-01 9:45   43.69
          2019-01-02 11:18  52.12
          2019-01-03 19:51  19.90
          2019-01-04 3:31   24.88
          2019-01-06 7:38   47.33
...                           ...
Urban     2019-05-08 1:54   32.69
          2019-05-08 2:31   41.33
          2019-05-08 4:20   21.99
          2019-05-08 4:39   18.45
          2019-05-08 7:29   18.55

[2364 rows x 1 columns]

In [201]:
## Reset data frame 
df_reset=Fares_by_cities_Dates.reset_index()
df_reset

     City Type              Date   Fare
0        Rural   2019-01-01 9:45  43.69
1        Rural  2019-01-02 11:18  52.12
2        Rural  2019-01-03 19:51  19.90
3        Rural   2019-01-04 3:31  24.88
4        Rural   2019-01-06 7:38  47.33
...        ...               ...    ...
2359     Urban   2019-05-08 1:54  32.69
2360     Urban   2019-05-08 2:31  41.33
2361     Urban   2019-05-08 4:20  21.99
2362     Urban   2019-05-08 4:39  18.45
2363     Urban   2019-05-08 7:29  18.55

[2364 rows x 3 columns]

In [202]:
# Create a Pivot Data Frame 
Pivot_data_df= pd.pivot_table(df_reset, values="Fare", index=["Date"],
                    columns=['City Type'] )
Pivot_data_df

City Type         Rural  Suburban  Urban
Date
2019-01-01 0:08     NaN       NaN  37.91
2019-01-01 0:46     NaN     47.74    NaN
2019-01-01 12:32    NaN     25.56    NaN
2019-01-01 14:40    NaN       NaN   5.42
2019-01-01 14:42    NaN       NaN  12.31
...                 ...       ...    ...
2019-05-08 1:54     NaN       NaN  32.69
2019-05-08 2:31     NaN       NaN  41.33
2019-05-08 4:20     NaN       NaN  21.99
2019-05-08 4:39     NaN       NaN  18.45
2019-05-08 7:29     NaN       NaN  18.55

[2361 rows x 3 columns]

In [241]:
#Create new data frame using loc function
New_Data_Frame= Pivot_data_df.loc["2019-01-01":"2019-04-28"]

In [242]:
New_Data_Frame

City Type         Rural  Suburban  Urban
Date
2019-01-01 0:08     NaN       NaN  37.91
2019-01-01 0:46     NaN     47.74    NaN
2019-01-01 12:32    NaN     25.56    NaN
2019-01-01 14:40    NaN       NaN   5.42
2019-01-01 14:42    NaN       NaN  12.31
...                 ...       ...    ...
2019-04-27 6:02   38.33       NaN    NaN
2019-04-27 6:20     NaN     28.29    NaN
2019-04-27 7:18     NaN     18.56    NaN
2019-04-27 7:34     NaN     30.28    NaN
2019-04-27 8:48     NaN       NaN  12.84

[2163 rows x 3 columns]

In [260]:
## Create a new data frame using resampling() and sum() method

New_Data_Frame.resample('W', on='week_starting').sum()

City Type      Rural  Suburban  Urban
week_starting
2019-01-06      0.00      0.00  37.91
2019-01-13      0.00     47.74   0.00
2019-01-20      0.00     25.56   0.00
2019-01-27      0.00      0.00   5.42
2019-02-03      0.00      0.00  12.31
...              ...       ...    ...
2060-05-16     38.33      0.00   0.00
2060-05-23      0.00     28.29   0.00
2060-05-30      0.00     18.56   0.00
2060-06-06      0.00     30.28   0.00
2060-06-13      0.00      0.00  12.84

[2163 rows x 3 columns]